cf_billing/Catalogs/энргНастройкиОтправкиПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргНастройкиОтправкиПисем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтправлятьМногопоточно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПорции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВПорции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьКаждоеПисьмоОтдельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргНастройкиОтправкиПисем/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеДанных

Функция АктуальныеДанные(СсылкаНаНастройку) Экспорт
	
	Результат = ПолучитьОписаниеОбъекта();
		
	Схема = Неопределено;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыОтбора	 = Новый Структура;
	ПараметрыВТ 	 = Новый Массив;
	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("Ссылка", "Ссылка")));
	ПараметрыЗапроса.Вставить("Ссылка", СсылкаНаНастройку);
		
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	АктуальныеДанныеСхема(Схема, ПараметрыОтбора);	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;	
	
КонецФункции

Процедура АктуальныеДанныеСхема(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];		
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанные());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные = ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора = Пакет.Операторы[0];	
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		Отбор 				= ОператорВыбора.Отбор;
		ИмяТаблицыОтбор		= "ТаблицаИнформации";
		ДоступныеПараметры 	= "Ссылка";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Отбор, ИмяТаблицыОтбор, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМетоды 

Функция ПолучитьОписаниеОбъекта() Экспорт
	
	Результат = Новый Структура;
	Реквизиты = Метаданные.Справочники.энргНастройкиОтправкиПисем.Реквизиты;
	Для Каждого ТекРеквизит из Реквизиты Цикл
		Результат.Вставить(ТекРеквизит.Имя);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстЗапроса

Функция ТекстЗапросаАктуальныеДанные()
	
	Текст =
	"ВЫБРАТЬ
	|	ТаблицаИнформации.ОтправлятьМногопоточно КАК ОтправлятьМногопоточно,
	|	ТаблицаИнформации.КоличествоПотоков КАК КоличествоПотоков,
	|	ТаблицаИнформации.ИспользоватьПорции КАК ИспользоватьПорции,
	|	ТаблицаИнформации.КоличествоВПорции КАК КоличествоВПорции,
	|	ТаблицаИнформации.ОтправлятьКаждоеПисьмоОтдельно КАК ОтправлятьКаждоеПисьмоОтдельно
	|ИЗ
	|	Справочник.энргНастройкиОтправкиПисем КАК ТаблицаИнформации";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
